src/cf/InformationRegisters/ПараметрыПериодовСтажаПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыПериодовСтажаПФР</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидСтажаПФР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаПФР2014</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРесурсаВидСтажаПФР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРесурсаОрганизация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРесурсаПодразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРесурсаДолжность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗначениеРесурсаРегистровСостоянийСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоровСЗВ63</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КадровыйПеревод</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПараметрыПериодовСтажаПФР/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыПериодовСтажаПФР.ГоловнаяОрганизация,
	|	ПараметрыПериодовСтажаПФР.ФизическоеЛицо,
	|	ПараметрыПериодовСтажаПФР.ТипДоговора,
	|	ПараметрыПериодовСтажаПФР.Начало,
	|	ПараметрыПериодовСтажаПФР.Окончание,
	|	ПараметрыПериодовСтажаПФР.Приоритет,
	|	ПараметрыПериодовСтажаПФР.Сторно,
	|	ПараметрыПериодовСтажаПФР.ДокументОснование,
	|	ПараметрыПериодовСтажаПФР.ВидСтажаПФР,
	|	ПараметрыПериодовСтажаПФР.Организация,
	|	ПараметрыПериодовСтажаПФР.Подразделение,
	|	ПараметрыПериодовСтажаПФР.Должность,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВидСтажаПФР,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОрганизация,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаПодразделение,
	|	ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжность
	|ПОМЕСТИТЬ ВТПредыдущиеДанныеРегистра
	|ИЗ
	|	РегистрСведений.ПараметрыПериодовСтажаПФР КАК ПараметрыПериодовСтажаПФР
	|ГДЕ
	|	ПараметрыПериодовСтажаПФР.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	

	Если Не ДополнительныеСвойства.Свойство("МенеджерВременныхТаблиц") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СравнениеСПредыдущимНабором.ГоловнаяОрганизация,
	|	СравнениеСПредыдущимНабором.ФизическоеЛицо,
	|	СравнениеСПредыдущимНабором.ТипДоговора,
	|	СравнениеСПредыдущимНабором.Начало,
	|	СравнениеСПредыдущимНабором.Окончание,
	|	СравнениеСПредыдущимНабором.Приоритет,
	|	СравнениеСПредыдущимНабором.Сторно,
	|	СравнениеСПредыдущимНабором.ДокументОснование,
	|	СравнениеСПредыдущимНабором.ВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.Организация,
	|	СравнениеСПредыдущимНабором.Подразделение,
	|	СравнениеСПредыдущимНабором.Должность,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОрганизация,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаПодразделение,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаДолжность,
	|	СУММА(СравнениеСПредыдущимНабором.ФлагИзменений) КАК ФлагИзменений
	|ПОМЕСТИТЬ ВТИзменившиесяДанные
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПредыдущиеДанныеРегистра.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		ПредыдущиеДанныеРегистра.ФизическоеЛицо КАК ФизическоеЛицо,
	|		ПредыдущиеДанныеРегистра.ТипДоговора КАК ТипДоговора,
	|		ПредыдущиеДанныеРегистра.Начало КАК Начало,
	|		ПредыдущиеДанныеРегистра.Окончание КАК Окончание,
	|		ПредыдущиеДанныеРегистра.Приоритет КАК Приоритет,
	|		ПредыдущиеДанныеРегистра.Сторно КАК Сторно,
	|		ПредыдущиеДанныеРегистра.ДокументОснование КАК ДокументОснование,
	|		ПредыдущиеДанныеРегистра.ВидСтажаПФР КАК ВидСтажаПФР,
	|		ПредыдущиеДанныеРегистра.Организация КАК Организация,
	|		ПредыдущиеДанныеРегистра.Подразделение КАК Подразделение,
	|		ПредыдущиеДанныеРегистра.Должность КАК Должность,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаВидСтажаПФР КАК ИспользованиеРесурсаВидСтажаПФР,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаОрганизация КАК ИспользованиеРесурсаОрганизация,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаПодразделение КАК ИспользованиеРесурсаПодразделение,
	|		ПредыдущиеДанныеРегистра.ИспользованиеРесурсаДолжность КАК ИспользованиеРесурсаДолжность,
	|		1 КАК ФлагИзменений
	|	ИЗ
	|		ВТПредыдущиеДанныеРегистра КАК ПредыдущиеДанныеРегистра
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПараметрыПериодовСтажаПФР.ГоловнаяОрганизация,
	|		ПараметрыПериодовСтажаПФР.ФизическоеЛицо,
	|		ПараметрыПериодовСтажаПФР.ТипДоговора,
	|		ПараметрыПериодовСтажаПФР.Начало,
	|		ПараметрыПериодовСтажаПФР.Окончание,
	|		ПараметрыПериодовСтажаПФР.Приоритет,
	|		ПараметрыПериодовСтажаПФР.Сторно,
	|		ПараметрыПериодовСтажаПФР.ДокументОснование,
	|		ПараметрыПериодовСтажаПФР.ВидСтажаПФР,
	|		ПараметрыПериодовСтажаПФР.Организация,
	|		ПараметрыПериодовСтажаПФР.Подразделение,
	|		ПараметрыПериодовСтажаПФР.Должность,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаВидСтажаПФР,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаОрганизация,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаПодразделение,
	|		ПараметрыПериодовСтажаПФР.ИспользованиеРесурсаДолжность,
	|		-1
	|	ИЗ
	|		РегистрСведений.ПараметрыПериодовСтажаПФР КАК ПараметрыПериодовСтажаПФР
	|	ГДЕ
	|		ПараметрыПериодовСтажаПФР.Регистратор = &Регистратор) КАК СравнениеСПредыдущимНабором
	|
	|СГРУППИРОВАТЬ ПО
	|	СравнениеСПредыдущимНабором.ФизическоеЛицо,
	|	СравнениеСПредыдущимНабором.ТипДоговора,
	|	СравнениеСПредыдущимНабором.Начало,
	|	СравнениеСПредыдущимНабором.Окончание,
	|	СравнениеСПредыдущимНабором.Приоритет,
	|	СравнениеСПредыдущимНабором.Сторно,
	|	СравнениеСПредыдущимНабором.ДокументОснование,
	|	СравнениеСПредыдущимНабором.ВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.Организация,
	|	СравнениеСПредыдущимНабором.Подразделение,
	|	СравнениеСПредыдущимНабором.Должность,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаВидСтажаПФР,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаОрганизация,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаПодразделение,
	|	СравнениеСПредыдущимНабором.ИспользованиеРесурсаДолжность,
	|	СравнениеСПредыдущимНабором.ГоловнаяОрганизация
	|
	|ИМЕЮЩИЕ
	|	СУММА(СравнениеСПредыдущимНабором.ФлагИзменений) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзменившиесяДанные.ГоловнаяОрганизация,
	|	ИзменившиесяДанные.ФизическоеЛицо,
	|	ИзменившиесяДанные.ТипДоговора
	|ПОМЕСТИТЬ ВТКлючиИзменившихсяДанных
	|ИЗ
	|	ВТИзменившиесяДанные КАК ИзменившиесяДанные";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	Запрос.Выполнить();

	УчетСтажаПФР.ОбновитьДанныеВторичногоРегистра(Запрос.МенеджерВременныхТаблиц);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
